load/results/20260914-133445-orders-write-pg-vus2.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load\k6-scenarios.js
        output: -

     scenarios: (100.00%) 1 scenario, 2 max VUs, 50s max duration (incl. graceful stop):
              * load: 2 looping VUs for 20s (gracefulStop: 30s)


running (01.0s), 2/2 VUs, 43 complete and 0 interrupted iterations
load   [   5% ] 2 VUs  00.9s/20s

running (02.0s), 2/2 VUs, 88 complete and 0 interrupted iterations
load   [  10% ] 2 VUs  01.9s/20s

running (03.0s), 2/2 VUs, 136 complete and 0 interrupted iterations
load   [  15% ] 2 VUs  02.9s/20s

running (04.0s), 2/2 VUs, 162 complete and 0 interrupted iterations
load   [  20% ] 2 VUs  03.9s/20s

running (05.0s), 2/2 VUs, 170 complete and 0 interrupted iterations
load   [  25% ] 2 VUs  04.9s/20s

running (06.0s), 2/2 VUs, 181 complete and 0 interrupted iterations
load   [  30% ] 2 VUs  05.9s/20s

running (07.0s), 2/2 VUs, 229 complete and 0 interrupted iterations
load   [  35% ] 2 VUs  06.9s/20s

running (08.0s), 2/2 VUs, 273 complete and 0 interrupted iterations
load   [  40% ] 2 VUs  07.9s/20s

running (09.0s), 2/2 VUs, 325 complete and 0 interrupted iterations
load   [  45% ] 2 VUs  08.9s/20s

running (10.0s), 2/2 VUs, 352 complete and 0 interrupted iterations
load   [  50% ] 2 VUs  09.9s/20s

running (11.0s), 2/2 VUs, 389 complete and 0 interrupted iterations
load   [  55% ] 2 VUs  10.9s/20s

running (12.1s), 2/2 VUs, 407 complete and 0 interrupted iterations
load   [  60% ] 2 VUs  12.1s/20s

running (13.0s), 2/2 VUs, 440 complete and 0 interrupted iterations
load   [  65% ] 2 VUs  12.9s/20s

running (14.0s), 2/2 VUs, 485 complete and 0 interrupted iterations
load   [  70% ] 2 VUs  13.9s/20s

running (15.0s), 2/2 VUs, 535 complete and 0 interrupted iterations
load   [  75% ] 2 VUs  14.9s/20s

running (16.0s), 2/2 VUs, 576 complete and 0 interrupted iterations
load   [  80% ] 2 VUs  15.9s/20s

running (17.0s), 2/2 VUs, 629 complete and 0 interrupted iterations
load   [  85% ] 2 VUs  16.9s/20s

running (18.0s), 2/2 VUs, 667 complete and 0 interrupted iterations
load   [  90% ] 2 VUs  17.9s/20s

running (19.0s), 2/2 VUs, 713 complete and 0 interrupted iterations
load   [  95% ] 2 VUs  18.9s/20s

running (20.0s), 2/2 VUs, 768 complete and 0 interrupted iterations
load   [ 100% ] 2 VUs  19.9s/20s


  █ TOTAL RESULTS 

    checks_total.......: 1542    76.751309/s
    checks_succeeded...: 100.00% 1542 out of 1542
    checks_failed......: 0.00%   0 out of 1542

    ✓ order created 201
    ✓ order deleted 204

    HTTP
    http_req_duration..............: avg=25.18ms min=5.71ms  med=15.9ms max=779.83ms p(90)=30.93ms p(95)=52.19ms 
      { expected_response:true }...: avg=25.18ms min=5.71ms  med=15.9ms max=779.83ms p(90)=30.93ms p(95)=52.19ms 
    http_req_failed................: 0.00%  0 out of 1544
    http_reqs......................: 1544   76.850857/s

    EXECUTION
    iteration_duration.............: avg=51.9ms  min=25.14ms med=32.8ms max=813.78ms p(90)=69.78ms p(95)=138.48ms
    iterations.....................: 771    38.375655/s
    vus............................: 2      min=2         max=2
    vus_max........................: 2      min=2         max=2

    NETWORK
    data_received..................: 292 kB 15 kB/s
    data_sent......................: 378 kB 19 kB/s



running (20.1s), 0/2 VUs, 771 complete and 0 interrupted iterations
load ✓ [ 100% ] 2 VUs  20s