load/results/20260914-133445-orders-write-pg-vus32.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load\k6-scenarios.js
        output: -

     scenarios: (100.00%) 1 scenario, 32 max VUs, 50s max duration (incl. graceful stop):
              * load: 32 looping VUs for 20s (gracefulStop: 30s)


running (01.0s), 32/32 VUs, 4 complete and 0 interrupted iterations
load   [   5% ] 32 VUs  01.0s/20s

running (02.0s), 32/32 VUs, 34 complete and 0 interrupted iterations
load   [  10% ] 32 VUs  02.0s/20s

running (03.0s), 32/32 VUs, 34 complete and 0 interrupted iterations
load   [  15% ] 32 VUs  03.0s/20s

running (04.0s), 32/32 VUs, 52 complete and 0 interrupted iterations
load   [  20% ] 32 VUs  04.0s/20s

running (05.0s), 32/32 VUs, 53 complete and 0 interrupted iterations
load   [  25% ] 32 VUs  05.0s/20s

running (06.0s), 32/32 VUs, 65 complete and 0 interrupted iterations
load   [  30% ] 32 VUs  06.0s/20s

running (07.0s), 32/32 VUs, 81 complete and 0 interrupted iterations
load   [  35% ] 32 VUs  07.0s/20s

running (08.0s), 32/32 VUs, 97 complete and 0 interrupted iterations
load   [  40% ] 32 VUs  08.0s/20s

running (09.0s), 32/32 VUs, 104 complete and 0 interrupted iterations
load   [  45% ] 32 VUs  09.0s/20s

running (10.0s), 32/32 VUs, 128 complete and 0 interrupted iterations
load   [  50% ] 32 VUs  10.0s/20s

running (11.0s), 32/32 VUs, 140 complete and 0 interrupted iterations
load   [  55% ] 32 VUs  11.0s/20s

running (12.0s), 32/32 VUs, 151 complete and 0 interrupted iterations
load   [  60% ] 32 VUs  12.0s/20s

running (13.0s), 32/32 VUs, 155 complete and 0 interrupted iterations
load   [  65% ] 32 VUs  13.0s/20s

running (14.0s), 32/32 VUs, 190 complete and 0 interrupted iterations
load   [  70% ] 32 VUs  14.0s/20s

running (15.0s), 32/32 VUs, 191 complete and 0 interrupted iterations
load   [  75% ] 32 VUs  15.0s/20s

running (16.0s), 32/32 VUs, 243 complete and 0 interrupted iterations
load   [  80% ] 32 VUs  16.0s/20s

running (17.0s), 32/32 VUs, 259 complete and 0 interrupted iterations
load   [  85% ] 32 VUs  17.0s/20s

running (18.0s), 32/32 VUs, 328 complete and 0 interrupted iterations
load   [  90% ] 32 VUs  18.0s/20s

running (19.0s), 32/32 VUs, 420 complete and 0 interrupted iterations
load   [  95% ] 32 VUs  19.0s/20s

running (20.0s), 32/32 VUs, 484 complete and 0 interrupted iterations
load   [ 100% ] 32 VUs  20.0s/20s


  █ TOTAL RESULTS 

    checks_total.......: 1023   50.034954/s
    checks_succeeded...: 99.12% 1014 out of 1023
    checks_failed......: 0.87%  9 out of 1023

    ✗ order created 201
      ↳  98% — ✓ 507 / ✗ 9
    ✓ order deleted 204

    HTTP
    http_req_duration..............: avg=634.63ms min=6.09ms  med=110.23ms max=6.51s p(90)=1.73s p(95)=3.32s
      { expected_response:true }...: avg=585.37ms min=6.09ms  med=107.76ms max=6.17s p(90)=1.59s p(95)=2.87s
    http_req_failed................: 0.87%  9 out of 1025
    http_reqs......................: 1025   50.132774/s

    EXECUTION
    iteration_duration.............: avg=1.26s    min=36.35ms med=561.86ms max=9.55s p(90)=4.33s p(95)=5.92s
    iterations.....................: 516    25.237572/s
    vus............................: 32     min=32        max=32
    vus_max........................: 32     min=32        max=32

    NETWORK
    data_received..................: 196 kB 9.6 kB/s
    data_sent......................: 252 kB 12 kB/s



running (20.4s), 00/32 VUs, 516 complete and 0 interrupted iterations
load ✓ [ 100% ] 32 VUs  20s