load/results/20260914-133445-orders-write-pg-vus8.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load\k6-scenarios.js
        output: -

     scenarios: (100.00%) 1 scenario, 8 max VUs, 50s max duration (incl. graceful stop):
              * load: 8 looping VUs for 20s (gracefulStop: 30s)


running (01.0s), 8/8 VUs, 67 complete and 0 interrupted iterations
load   [   5% ] 8 VUs  00.9s/20s

running (02.0s), 8/8 VUs, 147 complete and 0 interrupted iterations
load   [  10% ] 8 VUs  01.9s/20s

running (03.0s), 8/8 VUs, 234 complete and 0 interrupted iterations
load   [  15% ] 8 VUs  02.9s/20s

running (04.0s), 8/8 VUs, 311 complete and 0 interrupted iterations
load   [  20% ] 8 VUs  03.9s/20s

running (05.1s), 8/8 VUs, 355 complete and 0 interrupted iterations
load   [  25% ] 8 VUs  05.0s/20s

running (06.0s), 8/8 VUs, 420 complete and 0 interrupted iterations
load   [  30% ] 8 VUs  05.9s/20s

running (07.0s), 8/8 VUs, 494 complete and 0 interrupted iterations
load   [  35% ] 8 VUs  06.9s/20s

running (08.0s), 8/8 VUs, 513 complete and 0 interrupted iterations
load   [  40% ] 8 VUs  07.9s/20s

running (09.0s), 8/8 VUs, 543 complete and 0 interrupted iterations
load   [  45% ] 8 VUs  08.9s/20s

running (10.0s), 8/8 VUs, 616 complete and 0 interrupted iterations
load   [  50% ] 8 VUs  09.9s/20s

running (11.0s), 8/8 VUs, 678 complete and 0 interrupted iterations
load   [  55% ] 8 VUs  10.9s/20s

running (12.0s), 8/8 VUs, 717 complete and 0 interrupted iterations
load   [  60% ] 8 VUs  12.0s/20s

running (13.0s), 8/8 VUs, 757 complete and 0 interrupted iterations
load   [  65% ] 8 VUs  13.0s/20s

running (14.0s), 8/8 VUs, 798 complete and 0 interrupted iterations
load   [  70% ] 8 VUs  13.9s/20s

running (15.0s), 8/8 VUs, 889 complete and 0 interrupted iterations
load   [  75% ] 8 VUs  14.9s/20s

running (16.0s), 8/8 VUs, 985 complete and 0 interrupted iterations
load   [  80% ] 8 VUs  15.9s/20s

running (17.0s), 8/8 VUs, 1093 complete and 0 interrupted iterations
load   [  85% ] 8 VUs  16.9s/20s

running (18.0s), 8/8 VUs, 1193 complete and 0 interrupted iterations
load   [  90% ] 8 VUs  17.9s/20s

running (19.0s), 8/8 VUs, 1280 complete and 0 interrupted iterations
load   [  95% ] 8 VUs  18.9s/20s

running (20.0s), 8/8 VUs, 1352 complete and 0 interrupted iterations
load   [ 100% ] 8 VUs  19.9s/20s


  █ TOTAL RESULTS 

    checks_total.......: 2734    135.964491/s
    checks_succeeded...: 100.00% 2734 out of 2734
    checks_failed......: 0.00%   0 out of 2734

    ✓ order created 201
    ✓ order deleted 204

    HTTP
    http_req_duration..............: avg=57.87ms  min=5.16ms  med=40.69ms max=920.05ms p(90)=86.51ms  p(95)=153.18ms
      { expected_response:true }...: avg=57.87ms  min=5.16ms  med=40.69ms max=920.05ms p(90)=86.51ms  p(95)=153.18ms
    http_req_failed................: 0.00%  0 out of 2736
    http_reqs......................: 2736   136.063953/s

    EXECUTION
    iteration_duration.............: avg=117.25ms min=34.46ms med=83.6ms  max=1.11s    p(90)=197.27ms p(95)=277.7ms 
    iterations.....................: 1367   67.982246/s
    vus............................: 8      min=8         max=8
    vus_max........................: 8      min=8         max=8

    NETWORK
    data_received..................: 519 kB 26 kB/s
    data_sent......................: 670 kB 33 kB/s



running (20.1s), 0/8 VUs, 1367 complete and 0 interrupted iterations
load ✓ [ 100% ] 8 VUs  20s